app/controllers/articles_controller.rb

  def index
binding.pry
    @articles = Article.order(:id).page params[:page]
---
SELECT  "articles".* FROM "articles" ORDER BY "articles"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "articles" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 5], ["OFFSET", 0]]

  def show
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @article = Article.new(article_params)
    @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "aaaaa"], ["text", "dddddd"], ["created_at", 2017-02-11 10:48:23 UTC], ["updated_at", 2017-02-11 10:48:23 UTC]]